// 은행 option 배열
export const bankOption = [
  "국민은행",
  "카카오뱅크",
  "농협은행",
  "신한은행",
  "우리은행",
  "기업은행",
  "하나은행",
  "새마을금고",
  "우체국",
  "SC제일은행",
  "대구은행",
  "부산은행",
  "경남은행",
  "광주은행",
  "신협",
  "수협은행",
  "산업은행",
  "전북은행",
  "제주은행",
  "씨티은행",
  "케이뱅크",
  "토스뱅크",
];

// 카드 option 배열
export const cardOption = [
  "KB국민카드",
  "롯데카드",
  "신한카드",
  "하나카드",
  "BC카드",
  "삼성카드",
  "현대카드",
  "우리카드",
  "NH농협카드",
  "씨티카드",
  "카카오뱅크카드",
  "토스뱅크카드",
  "키타(은행/증권)카드",
];

// 할부 option 배열
export const monthlyInstallment = [
  "일시불",
  "2개월 (무이자)",
  "3개월 (무이자)",
  "4개월",
  "5개월",
  "6개월 (부분무이자)",
  "7개월",
  "8개월",
  "9개월",
  "10개월 (부분무이자)",
  "11개월",
  "12개월 (부분무이자)",
  "13개월",
  "14개월",
  "15개월",
  "16개월",
  "17개월",
  "18개월 (부분무이자)",
  "19개월",
  "20개월",
  "21개월",
  "22개월",
  "23개월",
  "24개월 (부분무이자)",
];

// 법인카드 option 배열
export const corporateCardOption = [
  "KB국민카드",
  "롯데카드",
  "신한카드",
  "하나카드",
  "BC카드",
  "삼성카드",
  "현대카드",
  "NH농협카드",
  "토스뱅크카드",
  "기업은행",
  "대구은행",
  "부산은행",
  "우체국",
  "경남은행",
  "광주은행",
  "SC제일은행",
  "수협은행",
];

// 통신사 option 배열
export const phoneOption = ["SKT", "KT", "LGU+", "KCT"];

// 무통장입금 option 배열
export const noneBankOption = [
  "국민은행",
  "농협은행",
  "신한은행",
  "우리은행",
  "KEB하나은행",
];
